app/Controllers/Auth/Login.php

INSERT INTO "auth"."login_logs" ("user_id", "ip_address", "user_agent", "is_success", "credential_used") VALUES (NULL, '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/138.0.0.0 Safari/537.36', FALSE, 'isnansetiawan160@gmail.com')
SELECT *
FROM "auth"."login_logs"
WHERE "ip_address" = '::1'
AND "is_success" = TRUE
ORDER BY "id" DESC
 LIMIT 1
SELECT COUNT(*) AS "numrows"
FROM "auth"."login_logs"
WHERE "ip_address" = '::1'
AND "is_success" = FALSE
AND "login_at" > '2025-08-05 08:53:32.8292+07'
---
    public function eseclogin()
    {
        $userModel = new UserModel();
        $LoginLogModel = new LoginLogModel();
        $rules = [
            'credential' => [
                'label' => 'Email atau Username',
                'rules' => 'required|max_length[100]',
            ],
            'password' => [
                'label' => 'Password',
                'rules' => 'required',
            ],
        ];

        if (!$this->validate($rules)) {
            return $this->response->setJSON([
                'status' => false,
                'pesan' => $this->validator->getErrors()['credential'] ?? $this->validator->getErrors()['password'],
                'csrf_baru' => csrf_hash(),
            ]);
        }


        $email = $this->request->getPost('credential');
        $password = $this->request->getPost('password');
        $user = $userModel->getDataUserByEmail($email);

        if (!$user || !password_verify($password, $user['password_hash'])) {

            $LoginLogModel->save([
                'user_id'         => $user['id'] ?? null,
                'ip_address'      => $this->request->getIPAddress(),
                'user_agent'      => $this->request->getUserAgent()->getAgentString(),
                'is_success'      => false,
                'credential_used' => $email,
            ]);

            $TanggalBerhasilLoginTerakhir = $LoginLogModel->where(['ip_address' => $this->request->getIPAddress(), 'is_success' => true])->orderBy('id', 'DESC')->first()['login_at'] ?? '1970-01-01';
            $JumlahKegagalanLogin = $LoginLogModel->where(['ip_address' => $this->request->getIPAddress(), 'is_success' => false, 'login_at >' => $TanggalBerhasilLoginTerakhir])->countAllResults();