app/Filters/BruteForce/AntiBruteForce.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $logModel = new LoginLogModel();
        $IpBlockModel = new IpBlockModel();
        $ipAddress = $request->getIPAddress();
        $response = service('response');

        if ($IpBlockModel->isIpBlocked($ipAddress)) {
            session()->setFlashdata('Pesan_kirimke_halaman_locked_via_url', 'Alamat IP Anda telah diblokir secara permanen.');
            if ($request->isAJAX()) {
                return $response->setJSON(['Pesan_kirimke_ajax' => 'Anda tidak bisa login Selama lamanya :D', 'lempar_ke_url' => base_url('locked')]);
            } else {
                return redirect()->to(base_url('locked'));
            }
        }

        $terahirsukses = $logModel->where(['ip_address' => $ipAddress, 'is_success' => true])->orderBy('id', 'DESC')->first();
        $tanggalterahirsukses = $terahirsukses ? $terahirsukses['login_at'] : '1970-01-01 00:00:00';

        $dataWhere = [
            'ip_address' => $ipAddress,
            'is_success' => false,
            'login_at >' => $tanggalterahirsukses
        ];

        $getdata = $logModel->where($dataWhere)
            ->orderBy('id', 'ASC')
            ->findAll();
---
SELECT *
FROM "auth"."login_logs"
WHERE "ip_address" = '::1'
AND "is_success" = TRUE
ORDER BY "id" DESC
 LIMIT 1